[
    {
        "name": "Abhik Mondal",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/35ebe6a7-812f-476e-6159-92e6852b6900/public",
        "comment": "Meri shadi 4 mahine thi first-night ko lekar mai bahut tension me tha par Horse Fire Tablet ne mere marital life ko emajedar bnaya..Vo subah dard me thi par mere performance se kafi khush thi. Thanks Horse Fire"
    },
    {
        "name": "Brijesh Soni",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/b99acc99-acce-49ca-a1af-861cf3210500/public",
        "comment": "हॉर्सफायर खाने से पहले मेरा लिंग ढीला और छोटा भी था, माल भी जल्दी छूट जाता था पर अब घंटो तक सेक्स होता है और लिंग बृद्धि में इस दवा का परिणाम आपके सामने है"
    },
    {
        "name": "Umesh Panday",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/134ac53b-10f8-4fe3-479e-086d413f3400/public",
        "comment": "Yah dwa bahut asardar hai ise khane ke bad mera josh, power, size aur sex timing kafi bad gya hai...chhote ling aur jaldi jhad jane wale mardo ko is dwa ka upyog jarur krna chahiye. Ling par iska result unbelievable hai, aap dekh sakte hai."
    },
    {
        "name": "Sanjay Rajbhar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/35ebe6a7-812f-476e-6159-92e6852b6900/public",
        "comment": "मुझे शीघ्रपतन की समस्या थी, साइज भी जितना मैं चाहता था उससे कम थी। फिर मैने मेरे दोस्त के सुझाव से हॉर्सफायर टेबलेट खाया इससे मुझे जोरदार लाभ मिला। मेरी टाइमिंग कई गुना बढ़ गयी और मात्र 2 पैक में ही लिंग साइज का बदलाव भी आश्चर्यजनक था अब मेरे इन रॉड जैसे पेनिस से किसी भी महिला को ठोक के ठंडा कर सकता हूँ।"
    },
    {
        "name": "Sarvesh Kumar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/8e2fc363-dbca-49d8-a6d1-cfeee4612600/public",
        "comment": "Horse Fire Tablet khane ke bad meri sex timing me kafi sudhar hua hai aur Erection bhi jordar milta hai. Phle meri life partner mujhse kush nhi thi lekin ab vo meri tarif krti hai aur sex ko enjoy krti hai."
    },
    {
        "name": "Jitendra Jha ",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/04953bc6-23e0-4ddd-3b3c-3451206bd500/public",
        "comment": "Horse Fire Tablet is a real sex booster. It helps me to maintain stamina and erection for a long time sex... Also, my penis size increased which is amazing."
    },
    {
        "name": "Dinesh",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/a920bf8c-53fb-4ca9-b3ee-31f2d1c6ac00/public",
        "comment": "वर्क लोड और बढ़ती उम्र के साथ मेरी सेक्स इच्छा खत्म हो रही थी, लिंग में पर्याप्त इरेक्शन नहीं मिलती थी और डिस्चार्ज बहुत जल्दी हो जाता है पर इसे खाने के बाद सब इच्छा बढ़ गयी है हार्ड इरेक्शन के साथ सेक्स लम्बा चलता है। "
    },
    {
        "name": "Shobhan",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/c3010de6-07ae-49f4-cce0-70bc6dee1900/public",
        "comment": "पहले  पकड़ने पर पता ही नहीं चलता था और 2-4 झटके में पानी निकल जाता था पर Horsefire खाने के बाद तो मेरा लिंग मेरी GF के हाथ में पूरा नहीं आता है और वो घुसते ही सिसकने लगती है Horsefire Tablet बहुत असरदार है।"
    },
    {
        "name": "Chirag Panchal",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/70103b52-e81f-418b-ea48-950bd8583e00/public",
        "comment": "Main 2 mahine se is goli ko kha rha hu. Is adbhut goli ne meri kai sex problems ko mita diya...Is Horsefire ki goli se mera stamina, josh, timing aur penis size kafi jyada badhh gya hai..in dino me 7 cm se jyada size 25 minute se jyada timing badha hai."
    },
    {
        "name": "Alok Rane",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/01f5e026-e716-4762-18ae-b2353a5edc00/public",
        "comment": "मेरा लिंग पहले छोटा था। अब मुझे जैसा चाहिए था वैसा हो गया है मैंने निचे पहले के और अब के पिक दे रहा हूँ आप देख सकते है। इससे से के टाइम ड्यूरेशन में भी बड़ा बदलाव आया है !!"
    },
    {
        "name": "Vijay Kumar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/16e8a163-6877-4f34-caa0-18ac92851400/public",
        "comment": "मेरी कई GF हुई लेकिन मैं किसी को मजे नहीं दे पाता था। सबने ब्रेकअप कर लिया। Horsefire ने कमाल कर दिया। इस गोली से मेरी सेक्स पावर और पेनिस के साइज में बहुत सुधार हो गया है अब मेरी जो GF है वो मुझ से एकदम संतुष्ट रहती है। "
    },
    {
        "name": "Satya Prakash",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/917e8c8e-f302-4346-0034-f7d77de6ab00/public",
        "comment": "Abhi tak mai kai product use kar chuka hu...ye sabse a6aa hai. mere vichar se khaskar mere liye ye ayurved ka best formulation hai. Iska kuchh hi din use krne ke bad meri stamina aur timing increase ho gyi. Horse Fire Tablet ne meri marital life ko khushahal bna diya."
    },
    {
        "name": "Prashant Damle",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/74bc971f-b035-452f-aaf6-7ed8c2db2f00/public",
        "comment": "हे औषध खरोखर कार्य करते. या उत्पादनाने मला वयाच्या ४५ व्या वर्षी तरुण वाटले"
    },
    {
        "name": "Shyam Chaurasiya",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/dc09fec2-b2d1-4f4e-168b-54421ed8d700/public",
        "comment": "Yah waakai me kamaal ka ayurvedic stamina booster product hai, Iska koi comperesion nahi hai. Bilkul jaisa naam waisa kam hai iska gajab ki sex takt deta hai. Ab main pahle se kai guna jyada time tak enjoy kar paata hu."
    },
    {
        "name": "Ritu Juneja",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/d2700e1e-3209-4c92-f5ea-f9844dab9000/public",
        "comment": "This is best for men with short penish and lack of sex timing...jisse meri jaisi kitni sari females ko sex ka mja nhi mil paata hai..mere Husband ka penis kafi badh gya hai ab mujhe vo har bar thaka dete hai... mai har bar discharge ho jati hu par vo nhi hote hai. mujhe mja bahut milta hai...ab unka adha penis bhi orgasm de deta hai..."
    },
    {
        "name": "Nitesh Singh",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/48244b71-2f3d-441d-9f9b-2a40083d1d00/public",
        "comment": "इसका परिणाम बहुत शानदार है, जिस समस्या का सालों से इलाज करा रहा था पर कुछ खास असर नहीं हो रहा था। उसे इसने केवल 2 महीने में पूरी तरह से समाप्त कर दिया। दिल से धन्यवाद इसे बनाने वाले को"
    },
    {
        "name": "M. Amir",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/febde48d-b413-4109-da53-11394cc47700/public",
        "comment": "Very effective product...he feel's very energetic now"
    },
    {
        "name": "Vikash",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/7f024587-77a3-4218-b662-6a7364c76700/public",
        "comment": "Mujhe kmal ka result mila hai, iske istemal se ab meri timing kafi badh gyi hai...Part me hard erection milti hai jo jaldi dhila nhi padta hai."
    },
    {
        "name": "Shrikant Sharma",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/291fe6af-058e-49ef-30af-1f8a05e54800/public",
        "comment": "शुरुआत के २ महीने रेगुलर दोनों टाइम सेवन किया पर तीसरे महीने से एक दिन या दो दिन में एक गोली का सेवन करता हूँ क्यूंकि मेरी क्षमता और टाइमिंग में काफी सुधार हो चुका है। मेरी यौन जीवन को सुधारने के लिए थैंक्स हॉर्सफायर!!"
    }
]